/*
    Creation d'un convertiseur decimal en hexdeciaml
*/

/* Main program */
say "Entre un nombre decimal ?"
pull deci-nombre

say "votre nombre en hexa-decimal :"
exit

